PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc31xx/lpc31_analogdie.h
/************************************************************************************************
 * arch/arm/src/lpc31xx/lpc31_analogdie.h
 *
 *   Copyright (C) 2011 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC31XX_LPC31_ANALOGDIE_H
#define __ARCH_ARM_SRC_LPC31XX_LPC31_ANALOGDIE_H

/************************************************************************************************
 * Included Files
 ************************************************************************************************/

#include <nuttx/config.h>
#include "lpc31_memorymap.h"

/************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************/
/* I2C slave address ****************************************************************************/
/* "The analog die has its own register set which is accessed through the I2C1 interface. The
 *  analog block has one device slave address 0001100. All blocks in the analog die behave
 *  like one I2C slave device to the I2C1 interface."
 */

#define LPC31_ANALOG_I2CADDR            0x0c

/* I2C register base addresses ******************************************************************/

#define LPC31_ANALOG_CHARGER_BASE       0x0000
#define LPC31_ANALOG_CHARGER_SIZE       0x0010

#define LPC31_ANALOG_CODEC_BASE         0x0010
#define LPC31_ANALOG_CODEC_SIZE         0x0010

#define LPC31_ANALOG_RTC_BASE           0x0020
#define LPC31_ANALOG_RTC_SIZE           0x0010

/* Charger register addresses *******************************************************************/

#define LPC31_CHARGER_OTGDCLIC          0x0000 /* PSU and Li-ion charger control register */
#define LPC31_CHARGER_DCDCLIC           0x0001 /* PSU and Li-ion charger status register */
#define LPC31_CHARGER_CGU_ANALOG        0x0002 /* Analog die CGU control register */

/* Audio CODEC register addresses ***************************************************************/

#define LPC31_CODEC_AIN0                0x0010 /* Analog input PGA control */
#define LPC31_CODEC_AIN1                0x0011 /* Analog input control */
#define LPC31_CODEC_AOUT                0x0012 /* Analog output control */
#define LPC31_CODEC_DEC                 0x0013 /* Decimator control */
#define LPC31_CODEC_INT0                0x0014 /* Interpolator control */
#define LPC31_CODEC_INT1                0x0015 /* Interpolator volume control */
#define LPC31_CODEC_I2S1MUX             0x0016 /* I2S1 digital audio multiplexer control */
#define LPC31_CODEC_AOUTDECINT          0x0017 /* Analog out status */

/* RTC register addresses ***********************************************************************/

#define LPC31_RTC_TIME                  0x0020 /* RTC time shadow register */
#define LPC31_RTC_ALARMTIME             0x0021 /* RTC alarm time register */
#define LPC31_RTC_STATUS                0x0022 /* RTC status register */
#define LPC31_RTC_SETENASTAT            0x0023 /* RTC set/enable register */
#define LPC31_RTC_CLRENASTAT            0x0024 /* RTC clear register */

/* Charger register bit definitions *************************************************************/

/* PSU and Li-ion charger control register */

#define CHARGER_LIC_PONTBAT             (1 << 0)  /* Bit 0:  Enable temperature sensing for Li-ion battery */
#define CHARGER_LIC_PONTLIM             (1 << 1)  /* Bit 1:  Power for chip temperature control loop */
#define CHARGER_LIC_TT_SHIFT            (2)       /* Bits 2-4: Chip temperature control loop threshold */
#define CHARGER_LIC_TT_MASK             (7 << CHARGER_LIC_TT_SHIFT)
#define CHARGER_LIC_G_SHIFT             (5)       /* Bits 5-7: Chip temperature control loop gain */
#define CHARGER_LIC_G_MASK              (7 << CHARGER_LIC_G_SHIFT)
#define CHARGER_LIC_CS_SHIFT            (8)       /* Bits 8-11: Compensation setting */
#define CHARGER_LIC_CS_MASK             (15 << CHARGER_LIC_CS_SHIFT)
#define CHARGER_LIC_CHARGEENABLE        (1 << 12) /* Bit 12: Start charger */
#define CHARGER_DCDC_SEL1V8             (1 << 16) /* Bit 16: LDO3 settings */
#define CHARGER_DCDC2_ADJUST_SHIFT      (17)      /* Bits 17-19: DCDC2 voltage setting */
#define CHARGER_DCDC2_ADJUST_MASK       (7 << CHARGER_DCDC2_ADJUST_SHIFT)
#  define CHARGER_DCDC2_ADJUST_1p4V     (0 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 1.40 */
#  define CHARGER_DCDC2_ADJUST_1p33V    (1 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 1.33 */
#  define CHARGER_DCDC2_ADJUST_1p26V    (2 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 1.26 */
#  define CHARGER_DCDC2_ADJUST_1p19V    (3 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 1.19 */
#  define CHARGER_DCDC2_ADJUST_1p11V    (4 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 1.11 */
#  define CHARGER_DCDC2_ADJUST_1p04V    (5 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 1.04 */
#  define CHARGER_DCDC2_ADJUST_p97V     (6 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 0.97 */
#  define CHARGER_DCDC2_ADJUST_p9V      (7 << CHARGER_DCDC2_ADJUST_SHIFT) /* Output voltage 0.90 */
#define CHARGER_DCDC1_ADJUST_SHIFT      (20)      /* Bits 20-22: DCDC1 voltage setting */
#define CHARGER_DCDC1_ADJUST_MASK       (7 << CHARGER_DCDC1_ADJUST_SHIFT)
#  define CHARGER_DCDC1_ADJUST_3p2V     (0 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 3.2 */
#  define CHARGER_DCDC1_ADJUST_3p09V    (1 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 3.09 */
#  define CHARGER_DCDC1_ADJUST_2p97V    (2 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 2.97 */
#  define CHARGER_DCDC1_ADJUST_2p86V    (3 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 2.86 */
#  define CHARGER_DCDC1_ADJUST_2p74V    (4 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 2.74 */
#  define CHARGER_DCDC1_ADJUST_2p63V    (5 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 2.63 */
#  define CHARGER_DCDC1_ADJUST_2p51V    (6 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 2.51 */
#  define CHARGER_DCDC1_ADJUST_2p4V     (7 << CHARGER_DCDC1_ADJUST_SHIFT) /* Output voltage 2.40 */
#define CHARGER_DCDC_LDOON              (1 << 23) /* Bit 23: LDO on/off control */
#define CHARGER_DCDC_CLKSTABLE          (1 << 24) /* Bit 24: DCDC clock control */
#define CHARGER_USBOTG                  (1 << 28) /* Bit 28: USBOTG charge pump control */

/* PSU and Li-ion charger status register */

#define CHARGER_LIC_TEMPBATOK           (1 << 0)  /* Bit 0:  Battery temperature OK indicator */
#define CHARGER_LIC_NONTC               (1 << 1)  /* Bit 1:  No NTC indicator */
#define CHARGER_LIC_CVCHARGE            (1 << 2)  /* Bit 2:  Constant-voltage charge indicator */
#define CHARGER_LIC_FASTCHARGE          (1 << 3)  /* Bit 3:  Fast-charge indicator (100% current) */
#define CHARGER_LIC_TRICKLECHARGE       (1 << 4)  /* Bit 4:  Trickle-charge indicator (10% current) */
#define CHARGER_LIC_BATTERYFULL         (1 << 5)  /* Bit 5:  Battery full indicator */
#define CHARGER_LIC_CHARGERON           (1 << 6)  /* Bit 6:  charger on indicator */
#define CHARGER_DCDC_INVRAMP_3V3        (1 << 16) /* Bit 16: DCDC1 mode status 4 */
#define CHARGER_DCDC_INVRAMP_1V2        (1 << 17) /* Bit 17: DCDC2 mode status 4 */
#define CHARGER_DCDC_INVINIT_3V3        (1 << 18) /* Bit 18: DCDC1 mode status 3 */
#define CHARGER_DCDC_INVINIT_1V2        (1 << 19) /* Bit 19: DCDC2 mode status 3 */
#define CHARGER_DCDC_INVDISC_3V3        (1 << 20) /* Bit 20: DCDC1 mode status 2 */
#define CHARGER_DCDC_INVDISC_1V2        (1 << 21) /* Bit 21: DCDC2 mode status 2 */
#define CHARGER_DCDC_INVCONT_3V3        (1 << 22) /* Bit 22: DCDC1 mode status 1 */
#define CHARGER_DCDC_INVCONT_1V2        (1 << 23) /* Bit 23: DCDC2 mode status 1 */
#define CHARGER_DCDC_USBDETECT          (1 << 24) /* Bit 24: USB VBUS supply detect */

